tutorials/pimpleHFDIBFoam/Patient_template_MV_01Oct/constant/timeVsFlow
(
    (0 0)
    (0.001 0)
    (0.002 0)
    (0.003 0)
    (0.004 1.6589e-07)
    (0.005 8.2288e-07)
    (0.006 1.4955e-06)
    (0.007 2.1933e-06)
    (0.008 2.9259e-06)
    (0.009 3.7029e-06)
    (0.01 4.534e-06)
    (0.011 5.4287e-06)
    (0.012 6.3967e-06)
    (0.013 7.4476e-06)
    (0.014 8.5909e-06)
    (0.015 9.8364e-06)
    (0.016 1.1194e-05)
    (0.017 1.2672e-05)
    (0.018 1.4282e-05)
    (0.019 1.6032e-05)
    (0.02 1.7927e-05)
    (0.021 1.9948e-05)
    (0.022 2.2063e-05)
    (0.023 2.4246e-05)
    (0.024 2.6465e-05)
    (0.025 2.8692e-05)
    (0.026 3.0899e-05)
    (0.027 3.3054e-05)
    (0.028 3.5131e-05)
    (0.029 3.7116e-05)
    (0.03 3.9049e-05)
    (0.031 4.0977e-05)
    (0.032 4.2948e-05)
    (0.033 4.501e-05)
    (0.034 4.7209e-05)
    (0.035 4.9595e-05)
    (0.036 5.2213e-05)
    (0.037 5.5109e-05)
    (0.038 5.8272e-05)
    (0.039 6.1655e-05)
    (0.04 6.5208e-05)
    (0.041 6.8882e-05)
    (0.042 7.2627e-05)
    (0.043 7.6393e-05)
    (0.044 8.0131e-05)
    (0.045 8.3793e-05)
    (0.046 8.7327e-05)
    (0.047 9.0688e-05)
    (0.048 9.3869e-05)
    (0.049 9.6902e-05)
    (0.05 9.982e-05)
    (0.051 0.00010266)
    (0.052 0.00010545)
    (0.053 0.00010822)
    (0.054 0.00011101)
    (0.055 0.00011386)
    (0.056 0.00011679)
    (0.057 0.00011984)
    (0.058 0.00012306)
    (0.059 0.00012648)
    (0.06 0.00013014)
    (0.061 0.00013408)
    (0.062 0.00013833)
    (0.063 0.00014287)
    (0.064 0.0001476)
    (0.065 0.0001524)
    (0.066 0.00015719)
    (0.067 0.00016184)
    (0.068 0.00016625)
    (0.069 0.00017035)
    (0.07 0.00017416)
    (0.071 0.00017775)
    (0.072 0.00018119)
    (0.073 0.00018454)
    (0.074 0.00018786)
    (0.075 0.00019123)
    (0.076 0.00019471)
    (0.077 0.00019831)
    (0.078 0.00020202)
    (0.079 0.00020585)
    (0.08 0.00020977)
    (0.081 0.0002138)
    (0.082 0.00021792)
    (0.083 0.00022212)
    (0.084 0.00022641)
    (0.085 0.00023073)
    (0.086 0.00023504)
    (0.087 0.00023929)
    (0.088 0.00024343)
    (0.089 0.00024741)
    (0.09 0.00025119)
    (0.091 0.00025475)
    (0.092 0.00025815)
    (0.093 0.00026144)
    (0.094 0.00026469)
    (0.095 0.00026794)
    (0.096 0.00027126)
    (0.097 0.00027469)
    (0.098 0.00027822)
...
);