tutorials/pimpleHFDIBFoam/Patient_template_MV_01Oct/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0.0001 );
//internalField   uniform ( 0 0 0 );

boundaryField
{
    WALL
    {
        type            movingWallVelocity;
        value           uniform ( 0 0 0 );
    }

   INLET
{
    type                pressureInletOutletVelocity;
    value               uniform (0 0 0);  // fallback value
}

    OUTLET
{
    type                flowRateOutletVelocity;
    volumetricFlowRate        table
    (
    (0.0000 0)
    (0.0005 0)
    (0.0010 0)
    (0.0015 0)
    (0.0020 0)
    (0.0025 0)
    (0.0030 0)
    (0.0035 0)
    (0.0040 0)
    (0.0045 0)
    (0.0050 0)
    (0.0055 0)
    (0.0060 0)
    (0.0065 0)
    (0.0070 0)
    (0.0075 0)
    (0.0080 0)
    (0.0085 0)
    (0.0090 0)
    (0.0095 0)
    (0.0100 0)
    (0.0105 0)
    (0.0110 0)
    (0.0115 0)
    (0.0120 0)
    (0.0125 0)
    (0.0130 0)
    (0.0135 0)
    (0.0140 0)
    (0.0145 0)
    (0.0150 0)
    (0.0155 0)
    (0.0160 0)
    (0.0165 0)
    (0.0170 0)
    (0.0175 0)
    (0.0180 0)
    (0.0185 0)
    (0.0190 0)
    (0.0195 0)
    (0.0200 0)
    (0.0205 0)
    (0.0210 0)
    (0.0215 0)
    (0.0220 0)
    (0.0225 0)
    (0.0230 0)
    (0.0235 0)
    (0.0240 0)
    (0.0245 0)
    (0.0250 0)
    (0.0255 0)
    (0.0260 0)
    (0.0265 0)
    (0.0270 0)
    (0.0275 0)
    (0.0280 0)
    (0.0285 0)
    (0.0290 0)
    (0.0295 0)
    (0.0300 0)
    (0.0305 0)
    (0.0310 0)
    (0.0315 0)
    (0.0320 0)
    (0.0325 0)
    (0.0330 0)
    (0.0335 0)
    (0.0340 0)
    (0.0345 0)
    (0.0350 0)
    (0.0355 0)
    (0.0360 0)
    (0.0365 0)
    (0.0370 0)
    (0.0375 0)
    (0.0380 0)
    (0.0385 0)
    (0.0390 0)
    (0.0395 0)
    (0.0400 0)
    (0.0405 0)
    (0.0410 0)
    (0.0415 0)
    (0.0420 0)
    (0.0425 0)
    (0.0430 0)
    (0.0435 0)
    (0.0440 0)
    (0.0445 0)
    (0.0450 0)
    (0.0455 0)
    (0.0460 0)
    (0.0465 0)
    (0.0470 0)
    (0.0475 0)
    (0.0480 0)
    (0.0485 0)
    (0.0490 0)
...
);
    value               uniform (0 0 0);
}
}


// ************************************************************************* //
