tutorials/pimpleHFDIBFoam/Patient_template_MV_01Oct/0/lambda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      lambda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/* Solver sets lambda from 'body' and smooths it each step (NO_READ).
   Supplying a zero stub is safe. */
dimensions      [0 0 0 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    INLET  { type zeroGradient; }
    OUTLET { type zeroGradient; }
    WALL   { type zeroGradient; }
}

// ************************************************************************* //
