tutorials/pimpleHFDIBFoam/Patient_template_MV_01Oct/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       pointVectorField;
    location    "0";
    object      pointDisplacement;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    WALL
    {
        // Value overwritten by the movingVentricle motion solver
        type    fixedValue;
        value   uniform (0 0 0);
    }
    INLET
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }
    OUTLET
    {
        type    fixedValue;
        value   uniform (0 0 0);
    }
}

// ************************************************************************* //
