tutorials/pimpleHFDIBFoam/Patient_template_MV_01Oct/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 8;

method          scotch;

// method          simple;

// simpleCoeffs
// {
//     n               (2 1 2);     // make 2 tiles in x–z, 4 in y
//     delta           0.001;
// }

// distributed     no;
// roots           ( );



// ************************************************************************* //
